/*********************************************************************************
 提供数据流缓冲区操作API。
*********************************************************************************/
#include <string.h>
#include <stdint.h>

#include "platform.h"

#include "streambuf.h"

/**********************************************************************
函数名称：sbufInit
函数功能：数据流缓冲区初始化
函数形参：sbuf，ptr，end
函数返回值：sbuf
函数描述：None
**********************************************************************/
sbuf_t *sbufInit(sbuf_t *sbuf, uint8_t *ptr, uint8_t *end)
{
    sbuf->ptr = ptr;
    sbuf->end = end;
    return sbuf;
}

/**********************************************************************
函数名称：sbufWriteU8
函数功能：数据流缓冲区写uint8_t类型数据
函数形参：dst，val
函数返回值：None
函数描述：None
**********************************************************************/
void sbufWriteU8(sbuf_t *dst, uint8_t val)
{
    *dst->ptr++ = val;
}

/**********************************************************************
函数名称：sbufWriteU16
函数功能：数据流缓冲区写uint16_t类型数据
函数形参：dst，val
函数返回值：None
函数描述：None
**********************************************************************/
void sbufWriteU16(sbuf_t *dst, uint16_t val)
{
    sbufWriteU8(dst, val >> 0);
    sbufWriteU8(dst, val >> 8);
}

/**********************************************************************
函数名称：sbufWriteU32
函数功能：数据流缓冲区写uint32_t类型数据
函数形参：dst，val
函数返回值：None
函数描述：None
**********************************************************************/
void sbufWriteU32(sbuf_t *dst, uint32_t val)
{
    sbufWriteU8(dst, val >> 0);
    sbufWriteU8(dst, val >> 8);
    sbufWriteU8(dst, val >> 16);
    sbufWriteU8(dst, val >> 24);
}

/**********************************************************************
函数名称：sbufWriteData
函数功能：数据流缓冲区写定长数据
函数形参：dst，data，len
函数返回值：None
函数描述：None
**********************************************************************/
void sbufWriteData(sbuf_t *dst, const void *data, int len)
{
    memcpy(dst->ptr, data, len);
    dst->ptr += len;
}

/**********************************************************************
函数名称：sbufWriteData
函数功能：数据流缓冲区写字符串
函数形参：dst，string
函数返回值：None
函数描述：None
**********************************************************************/
void sbufWriteString(sbuf_t *dst, const char *string)
{
    sbufWriteData(dst, string, strlen(string));
}

/**********************************************************************
函数名称：sbufReadU8
函数功能：数据流缓冲区读uint8_t类型数据
函数形参：src
函数返回值：数据
函数描述：None
**********************************************************************/
uint8_t sbufReadU8(sbuf_t *src)
{
    return *src->ptr++;
}

/**********************************************************************
函数名称：sbufReadU16
函数功能：数据流缓冲区读uint16_t类型数据
函数形参：src
函数返回值：数据
函数描述：None
**********************************************************************/
uint16_t sbufReadU16(sbuf_t *src)
{
    uint16_t ret;
    ret = sbufReadU8(src);
    ret |= sbufReadU8(src) << 8;
    return ret;
}

/**********************************************************************
函数名称：sbufReadU32
函数功能：数据流缓冲区读uint32_t类型数据
函数形参：src
函数返回值：数据
函数描述：None
**********************************************************************/
uint32_t sbufReadU32(sbuf_t *src)
{
    uint32_t ret;
    ret = sbufReadU8(src);
    ret |= sbufReadU8(src) <<  8;
    ret |= sbufReadU8(src) << 16;
    ret |= sbufReadU8(src) << 24;
    return ret;
}

/**********************************************************************
函数名称：sbufReadData
函数功能：数据流缓冲区读定长数据
函数形参：src，data，len
函数返回值：None
函数描述：None
**********************************************************************/
void sbufReadData(sbuf_t *src, void *data, int len)
{
    memcpy(data, src->ptr, len);
}

/**********************************************************************
函数名称：sbufBytesRemaining
函数功能：获取数据流缓冲区剩余字节
函数形参：src，data，len
函数返回值：reader - 返回缓冲区中剩余的字节，writer - 返回可用的空间
函数描述：None
**********************************************************************/
int sbufBytesRemaining(sbuf_t *buf)
{
    return buf->end - buf->ptr;
}

/**********************************************************************
函数名称：sbufPtr
函数功能：获取数据流缓冲区指针位置
函数形参：buf
函数返回值：ptr
函数描述：None
**********************************************************************/
uint8_t* sbufPtr(sbuf_t *buf)
{
    return buf->ptr;
}

/**********************************************************************
函数名称：sbufAdvance
函数功能：偏移数据流缓冲区指针位置
函数形参：buf，size
函数返回值：None
函数描述：
	reader - 跳过数据
	write - 提交写入数据
**********************************************************************/
void sbufAdvance(sbuf_t *buf, int size)
{
    buf->ptr += size;
}

/**********************************************************************
函数名称：sbufSwitchToReader
函数功能：修改数据流缓冲区，使写入的数据为读取做好准备
函数形参：buf，base
函数返回值：None
函数描述：None
**********************************************************************/
void sbufSwitchToReader(sbuf_t *buf, uint8_t *base)
{
    buf->end = buf->ptr;
    buf->ptr = base;
}

